Repository: ahmed-hinai/prayer_time_silencer
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Language
ur: زبان

source: English
ur: انگریزی

source: Arabic
ur: عربی

source: Urdu
ur: اردو

source: Fajr
ur: فجر

source: Dhuhr
ur: ظهر

source: Asr
ur: عصر

source: Maghrib
ur: مغرب

source: Isha
ur: عشاء

source: Enter Location
ur: ایک پتہ درج کریں۔

# enterToRetrievePrayerTimes
source: Enter to retrieve prayer times for a specific address.
ur: مخصوص پتے کے لیے نماز کے اوقات کی بازیافت کے لیے درج کریں۔

source: Settings
ur: ترتیبات

source: About Us
ur: ہمارے بارے میں معلومات

# confirmSchedule
source: Schedule Times of Silence.
ur: خاموشی کے اوقات طے کریں۔

# confirmationMessage
source: Silence times have been scheduled.
ur: خاموشی کے اوقات طے کیے گئے ہیں۔

# endSchedule
source: End of scheduling
ur: شیڈولنگ کا اختتام

# startSchedule
source: Start of scheduling
ur: شیڈولنگ کا آغاز

source: Corrections
ur: اصلاحات

# correctionsMessage
source: It is likely that the prayer times are slightly inaccurate, hence it is advised to consult official prayer times and add a correction.
ur: ممکن ہے کہ نماز کے اوقات قدرے غلط ہوں، اس لیے یہ مشورہ دیا جاتا ہے کہ نماز کے سرکاری اوقات سے مشورہ کریں اور تصحیح شامل کریں۔

# doNotDistrubTitle
source: Do Not Disturb access required
ur: ڈسٹرب نہ کریں رسائی درکار ہے۔

# doNotDistrubBody
source: The app requires the Do Not Disturb access to function.
ur: ایپ کو فنکشن تک ڈسٹرب نہ کریں رسائی کی ضرورت ہے۔

# notificationTitle
source: Prayer Time Silencer
ur: نماز کے وقت فون کو خاموش کر دیں۔

# notificationBody
source: Your device will be silenced shortly
ur: آپ کا فون خاموش ہے۔

# notificationTitleBackground
source: Prayer Time Silencer
ur: نماز کے وقت فون کو خاموش کر دیں۔

# notificationBodyBackground
source: Scheduling your next times of silence
ur: ایپ درج ذیل خاموش اوقات کو شیڈول کرتی ہے۔

source: Ok
ur: ٹھیک ہے

# locationTooltip
source: Request current location.
ur: موجودہ مقام کی درخواست کریں۔

# editTooltip
source: Edit current scheduling.
ur: موجودہ نظام الاوقات میں ترمیم کریں۔

source: Begin Here
ur: یہاں سے شروع کریں۔

# aboutUsHello1
source: Hello! thank you for using my app. If you have any queries please feel free to contact me here:
ur: ہائے! میری ایپ استعمال کرنے کا شکریہ۔ اگر آپ کے کوئی سوالات ہیں تو بلا جھجھک مجھ سے یہاں رابطہ کریں:

# aboutUsHello2
source: You can also leave a review on the Google Play store citing any issues you may have or features you would like implemented.
ur: آپ گوگل پلے اسٹور پر ایک جائزہ بھی چھوڑ سکتے ہیں جس میں آپ کو درپیش کسی بھی مسائل یا خصوصیات کا ذکر کیا جا سکتا ہے جو آپ شامل کرنا چاہتے ہیں۔

# aboutUsApiTalk
source: This application uses the open source API provided by the good people at aladhan.com. The API serves as a main part of the functionality of this app.
ur: یہ ایپ aladhan.com پر بھائیوں کے ذریعہ فراہم کردہ اوپن سورس API کا استعمال کرتی ہے۔ یہ انٹرفیس اس ایپلی کیشن کی فعالیت کے ایک بڑے حصے کے طور پر کام کرتا ہے۔

# aboutUsFlutterTalk
source: This app was developed using flutter, an open-source UI software development kit. Many functions of the app mainly or partially use packages provided by the flutter community.
ur: اس ایپ کو فلٹر کے ساتھ تیار کیا گیا تھا، جو ایک اوپن سورس یوزر انٹرفیس سافٹ ویئر ڈویلپمنٹ کٹ ہے۔ ایپلیکیشن کے بہت سے فنکشنز بنیادی طور پر یا جزوی طور پر فلٹر کمیونٹی کے فراہم کردہ پیکجز کا استعمال کرتے ہیں۔

# schedulingSetting
source: Scheduling of times of silence
ur: خاموشی کے اوقات کا شیڈولنگ

# schedulingSettingSubtitle
source: This is on by default. You can turn it off if you would like to skip scheduling times of silence for a period of time.
ur: یہ بطور ڈیفالٹ آن ہوتا ہے۔ آپ اسے بند کر سکتے ہیں اگر آپ کچھ وقت کے لیے خاموشی کے شیڈولنگ اوقات کو چھوڑنا چاہتے ہیں۔

# schedulingIsOff
source: Scheduling has been turned off in the settings.
ur: خاموشی کے اوقات کو ترتیب دینا ترتیبات میں فعال نہیں ہے۔

# networkFailMessage
source: Can't connect to the internet. Trying to fetch local data..
ur: انٹرنیٹ سے منسلک نہیں ہو سکتا۔ مقامی ڈیٹا حاصل کرنے کی کوشش کر رہا ہے..

# failedMessage
source: Failed. Check your network connection and or that the app has location permission.
ur: ناکام اپنا نیٹ ورک کنکشن چیک کریں اور/یا ایپ کو مقام تک رسائی کی اجازت ہے۔
